# frozen_string_literal: true

cask_args appdir: "/Applications"

tap "buo/cask-upgrade"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"
tap "nodenv/nodenv"

brew "antigen"
brew "cfssl"
brew "chezmoi"
brew "cmake"
brew "colordiff"
brew "cowsay"
brew "direnv"
brew "fortune"
brew "gh"
brew "git"
brew "git-secrets"
brew "gnu-typist"
brew "go"
brew "golang-migrate"
brew "gtypist"
brew "hadolint"
brew "heroku"
brew "jenv"
brew "jq"
brew "lolcat"
brew "mas"
brew "nodenv"
brew "nodenv-aliases"
brew "nodenv-default-packages"
brew "nodenv-package-json-engine"
brew "nodenv-package-rehash"
# brew "nodenv-yarn-install" # git clone https://github.com/pine/nodenv-yarn-install.git "$(nodenv root)/plugins/nodenv-yarn-install"
brew "openjdk"
brew "protobuf"
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"
brew "pyenv"
brew "rbenv"
brew "rbenv-aliases"
brew "rbenv-default-gems"
# brew "rbenv-each"       # git clone https://github.com/rbenv/rbenv-each.git "$(rbenv root)"/plugins/rbenv-each
# brew "rbenv-gem-update" # git clone https://github.com/nicknovitski/rbenv-gem-update ~/.rbenv/plugins/rbenv-gem-update
# brew "rbenv-update"     # git clone https://github.com/rkh/rbenv-update.git "$(rbenv root)/plugins/rbenv-update"
brew "shellcheck"
brew "wget"
brew "yarn"

cask "1password"
cask "alfred"
cask "backblaze"
# cask "google-chrome"
cask "dash"
cask "discord"
cask "divvy"
cask "docker"
cask "dropbox"
cask "iterm2"
# cask "itsycal"
cask "postgres-unofficial"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "send-to-kindle"
# cask "slack"
cask "sonos"
cask "sourcetree"
cask "spotify"
cask "the-clock"
cask "todoist"
cask "visual-studio-code"
cask "zoom"

mas "Bear", id: 1091189122
mas "Save to Pocket", id: 1477385213
