# frozen_string_literal: true

cask_args appdir: "/Applications"

tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "buo/cask-upgrade"

brew "antigen"
brew "chezmoi"
brew "cowsay"
brew "direnv"
brew "fortune"
brew "gh"
brew "git"
brew "git-secrets"
brew "go"
brew "heroku"
brew "jq"
brew "lolcat"
brew "nodenv"
brew "openjdk"
brew "pyenv"
brew "rbenv"
brew "shellcheck"
brew "yarn"

cask "alfred"
cask "dash"
cask "divvy"
cask "iterm2"
cask "sourcetree"
cask "visual-studio-code"
